
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрДанныхПрофиль = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Профиль");
	ПрофильНастройкаПользовательская = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанныхПрофиль.ИдентификаторПользовательскойНастройки);
	
	Если ПрофильНастройкаПользовательская.Использование Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации КАК НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ КАК КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ КАК ПериодЗамера,
		               |	Замеры.КлючеваяОперация КАК КлючеваяОперация,
		               |	КлючевыеОперации.ЦелевоеВремя КАК ЦелевоеВремя,
		               |	КлючевыеОперации.Приоритет КАК Приоритет,
		               |	Замеры.Пользователь КАК Пользователь,
		               |	МИНИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМинимальное,
		               |	МАКСИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМаксимальное,
		               |	СУММА(Замеры.ВремяВыполнения) КАК ВремяВыполненияСуммарное,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения <= Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения > Замеры.КлючеваяОперация.ЦелевоеВремя
		               |					И Замеры.ВремяВыполнения <= 4 * Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 0.5
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т4_Пополам,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(Замеры.ДатаЗаписи, 0) = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК КоличествоЗамеров,
		               |	ВЫБОР
		               |		КОГДА КОЛИЧЕСТВО(*) < 2
		               |			ТОГДА 0
		               |		ИНАЧЕ (СУММА(Замеры.ВремяВыполнения * Замеры.ВремяВыполнения) - 2 * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СУММА(Замеры.ВремяВыполнения) + КОЛИЧЕСТВО(*) * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СРЕДНЕЕ(Замеры.ВремяВыполнения)) / (КОЛИЧЕСТВО(*) - 1)
		               |	КОНЕЦ КАК Дисперсия
		               |ИЗ
		               |	Документ.ТЦТест.ПроизводительностьИтераций КАК ТЦТестПроизводительностьИтераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗамерыВремени КАК Замеры
		               |		ПО ТЦТестПроизводительностьИтераций.ДатаНачалаИтерации <= Замеры.ДатаЗаписи
		               |			И ТЦТестПроизводительностьИтераций.ДатаОкончанияИтерации >= Замеры.ДатаЗаписи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиКлючевыхОпераций.КлючевыеОперацииПрофиля КАК КлючевыеОперации
		               |		ПО (КлючевыеОперации.Ссылка = &Профиль)
		               |			И (Замеры.КлючеваяОперация = КлючевыеОперации.КлючеваяОперация)
		               |ГДЕ
		               |	ТЦТестПроизводительностьИтераций.Ссылка = &Тест
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ,
		               |	Замеры.КлючеваяОперация,
		               |	КлючевыеОперации.ЦелевоеВремя,
		               |	КлючевыеОперации.Приоритет,
		               |	Замеры.Пользователь";
					   
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации КАК НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ КАК КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ КАК ПериодЗамера,
		               |	Замеры.КлючеваяОперация КАК КлючеваяОперация,
		               |	Замеры.КлючеваяОперация.ЦелевоеВремя КАК ЦелевоеВремя,
		               |	Замеры.КлючеваяОперация.Приоритет КАК Приоритет,
		               |	Замеры.Пользователь КАК Пользователь,
		               |	МИНИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМинимальное,
		               |	МАКСИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМаксимальное,
		               |	СУММА(Замеры.ВремяВыполнения) КАК ВремяВыполненияСуммарное,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения <= Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения > Замеры.КлючеваяОперация.ЦелевоеВремя
		               |					И Замеры.ВремяВыполнения <= 4 * Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 0.5
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т4_Пополам,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(Замеры.ДатаЗаписи, 0) = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК КоличествоЗамеров,
		               |	ВЫБОР
		               |		КОГДА КОЛИЧЕСТВО(*) < 2
		               |			ТОГДА 0
		               |		ИНАЧЕ (СУММА(Замеры.ВремяВыполнения * Замеры.ВремяВыполнения) - 2 * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СУММА(Замеры.ВремяВыполнения) + КОЛИЧЕСТВО(*) * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СРЕДНЕЕ(Замеры.ВремяВыполнения)) / (КОЛИЧЕСТВО(*) - 1)
		               |	КОНЕЦ КАК Дисперсия
		               |ИЗ
		               |	Документ.ТЦТест.ПроизводительностьИтераций КАК ТЦТестПроизводительностьИтераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗамерыВремени КАК Замеры
		               |		ПО ТЦТестПроизводительностьИтераций.ДатаНачалаИтерации <= Замеры.ДатаЗаписи
		               |			И ТЦТестПроизводительностьИтераций.ДатаОкончанияИтерации >= Замеры.ДатаЗаписи
		               |ГДЕ
		               |	ТЦТестПроизводительностьИтераций.Ссылка = &Тест
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ,
		               |	Замеры.КлючеваяОперация,
		               |	Замеры.КлючеваяОперация.ЦелевоеВремя,
		               |	Замеры.КлючеваяОперация.Приоритет,
		               |	Замеры.Пользователь";
		
	КонецЕсли;
	
	СхемаКомпоновкиДанных.НаборыДанных.ЗамерыТеста.Запрос = ТекстЗапроса;
		
КонецПроцедуры
