
Перем ПараметрыПриложения Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	
	// ТестЦентр
	Попытка
		ТЦКлиент.ОбработатьПараметрЗапуска(ПараметрЗапуска);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Тест-центр");
	КонецПопытки;
	// Конец ТестЦентр
		
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы	
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие;
	КонецЕсли;	
	
КонецПроцедуры
