
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда

		ОбщееКоличествоОдновременноЗапускаемыхВРМ = ТЦОбщий.ОбщееКоличествоОдновременноЗапускаемыхВРМПоУмолчанию();
		КоличествоОдновременноЗапускаемыхВРМАгента = ТЦОбщий.КоличествоОдновременноЗапускаемыхВРМАгентаПоУмолчанию();
		
		ТаймаутОпросаАгентов = ТЦОбщий.ТаймаутОпросаАгентовПоУмолчанию();
		ТаймаутЗапускаКлиента = ТЦОбщий.ТаймаутЗапускаКлиентаПоУмолчанию();
		ТаймаутОпросаКлиента = ТЦОбщий.ТаймаутОпросаКлиентаПоУмолчанию();
		ТаймаутЗагрузкиСценарияКлиентом = ТЦОбщий.ТаймаутЗагрузкиСценарияКлиентомПоУмолчанию();
		ТаймаутПодготовки = ТЦОбщий.ТаймаутПодготовкиПоУмолчанию();
		ТаймаутИнициализации = ТЦОбщий.ТаймаутИнициализацииПоУмолчанию();
		ТаймаутВыполнения = ТЦОбщий.ТаймаутВыполненияПоУмолчанию();
		ТаймаутЗаписиРезультатов = ТЦОбщий.ТаймаутЗаписиРезультатовПоУмолчанию();
		ТаймаутУдаленияДанных = ТЦОбщий.ТаймаутУдаленияДанныхПоУмолчанию();

	КонецЕсли;
	
КонецПроцедуры