// Обработчик проверки заполнения реквизитов обработки
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Тип = Перечисления.ТЦТипОбработки.Внутренняя Тогда
		Сообщение = Новый СообщениеПользователю();
		
		Если Не ПустаяСтрока(ЭтотОбъект.ИмяОбработки) Тогда
			Возврат;
		КонецЕсли;
		
		Сообщение.Текст = "Не выбрана тестовая обработка";
		Сообщение.Поле = "ИмяОбработки";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
