
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		ТолькоПросмотр = Не ЭтоНовый();
		Элементы.Роль.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Пользователь.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Клиент.ТолькоПросмотр = ТолькоПросмотр;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// 
//
// Параметры:
//  
//
// Возвращаемое значение:
//  
//
Функция ЭтоНовый()
	
	Возврат РеквизитФормыВЗначение("Объект").ЭтоНовый();
	
КонецФункции // ЭтоНовый()